In [78]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Anny', 'Bobby', 'Charter', 'Devendra'],
    'Age': [24, 27, 22, 32, 45, 33, 44, 20],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston','Japan','China','Singapore','India']
}

df = pd.DataFrame(data)
df

       Name  Age         City
0     Alice   24     New York
1       Bob   27  Los Angeles
2   Charlie   22      Chicago
3     David   32      Houston
4      Anny   45        Japan
5     Bobby   33        China
6   Charter   44    Singapore
7  Devendra   20        India

In [64]:
#columns attribute
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [66]:
narray = np.array([[10,20,30,40],[50,60,70,80],[90,100,110,120]])
narray

array([[ 10,  20,  30,  40],
       [ 50,  60,  70,  80],
       [ 90, 100, 110, 120]])

In [68]:
d = pd.DataFrame(narray)
d

    0    1    2    3
0  10   20   30   40
1  50   60   70   80
2  90  100  110  120

In [70]:
#If there is no label in the dataframe column
d.columns

RangeIndex(start=0, stop=4, step=1)

In [72]:
c = pd.DataFrame(narray, columns=['C1','C2','C3','C4'])
c

   C1   C2   C3   C4
0  10   20   30   40
1  50   60   70   80
2  90  100  110  120

In [74]:
# giving column names
c.columns

Index(['C1', 'C2', 'C3', 'C4'], dtype='object')

In [80]:
# select only one column
df['Name']

0       Alice
1         Bob
2     Charlie
3       David
4        Anny
5       Bobby
6     Charter
7    Devendra
Name: Name, dtype: object

In [86]:
# select only multiple columns
df[['Name','City']]

       Name         City
0     Alice     New York
1       Bob  Los Angeles
2   Charlie      Chicago
3     David      Houston
4      Anny        Japan
5     Bobby        China
6   Charter    Singapore
7  Devendra        India

In [88]:
# select multiple columns in reverse order
df[['City', 'Name']]

          City      Name
0     New York     Alice
1  Los Angeles       Bob
2      Chicago   Charlie
3      Houston     David
4        Japan      Anny
5        China     Bobby
6    Singapore   Charter
7        India  Devendra